; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	Star9 - direction
	Star8 - direction
	GroundStation13 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star11 - direction
	Star12 - direction
	Star1 - direction
	Star5 - direction
	Star10 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star12)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star12)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 Star10)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star4)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Planet14 spectrograph2)
	(have_image Planet15 spectrograph2)
	(have_image Planet16 spectrograph2)
	(have_image Star17 spectrograph1)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation0 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 5
4. (turn_to satellite1 star4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star4)
   goals met: 1 of 5
5. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 1 of 5
6. (turn_to satellite1 planet14 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet14)
   goals met: 1 of 5
7. (take_image satellite1 planet14 instrument4 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 2 of 5
8. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 2 of 5
9. (take_image satellite1 planet15 instrument4 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 3 of 5
10. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 3 of 5
11. (take_image satellite1 planet16 instrument4 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 4 of 5
12. (turn_to satellite0 star1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star1)
   goals met: 3 of 5
13. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 3 of 5
14. (turn_to satellite0 groundstation0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 5
15. (turn_to satellite0 star17 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star17)
   goals met: 3 of 5
16. (take_image satellite0 star17 instrument1 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 4 of 5
17. (turn_to satellite0 groundstation0 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 5
